[
  {
    "title": "Physics-Informed Neural Network Surrogate Models for River Stage Prediction",
    "authors": "Maximilian Zoch, Edward Holmberg, Pujan Pokhrel, Ken Pathak, Steven Sloan, Kendall Niles, Jay Ratcliff, Maik Flanagin, Elias Ioup, Christian Guetl, Mahdi Abdelguerfi",
    "year": 2025,
    "journal": "arXiv",
    "doi": "10.48550/arXiv.2503.16850",
    "abstract": "This work investigates the feasibility of using Physics-Informed Neural Networks (PINNs) as surrogate models for river stage prediction, aiming to reduce computational cost while maintaining predictive accuracy. By integrating the governing Saint-Venant equations into the learning process, the proposed PINN-based surrogate model enforces physical consistency and significantly improves computational efficiency compared to HEC-RAS.",
    "keywords": ["physics-informed neural networks", "river stage prediction", "surrogate model", "hydrology"]
  },
  {
    "title": "A surrogate approach to model groundwater level in time and space based on tree regressors",
    "authors": "Various (Applied Water Science)",
    "year": 2025,
    "journal": "Applied Water Science",
    "doi": "10.1007/s13201-025-02572-5",
    "abstract": "This research presents a machine learning approach to predict groundwater levels in time and space based on tree regressors. Algorithms tested include Random forest, ExtraTrees and gradient boosting regression, with generalization scores in excess of 0.95 for wet, dry and average climatic conditions.",
    "keywords": ["tree regressors", "groundwater level", "machine learning", "surrogate model"]
  },
  {
    "title": "Investigating Steady Unconfined Groundwater Flow using Physics Informed Neural Networks",
    "authors": "Mohammad Afzal Shadab, et al.",
    "year": 2021,
    "journal": "arXiv",
    "doi": "10.48550/arXiv.2112.13792",
    "abstract": "A novel deep learning technique called Physics Informed Neural Networks (PINNs) is adapted to study steady groundwater flow in unconfined aquifers. This technique utilizes information from underlying physics represented in the form of partial differential equations (PDEs) alongside data obtained from physical observations.",
    "keywords": ["physics-informed neural networks", "unconfined groundwater flow", "Dupuit-Boussinesq equation", "deep learning"]
  },
  {
    "title": "Use of Multifidelity Training Data and Transfer Learning for Efficient Construction of Subsurface Flow Surrogate Models",
    "authors": "Su Jiang, Louis J. Durlofsky",
    "year": 2022,
    "journal": "Journal of Computational Physics",
    "doi": "10.1016/j.jcp.2022.111800",
    "abstract": "This work presents a framework where most of the training simulations are performed on coarsened geomodels using flow-based upscaling. The framework entails the use of a transfer-learning procedure incorporated within an existing recurrent residual U-Net architecture. Using 2500 low-fidelity runs and 200 high-fidelity runs leads to about a 90% reduction in training simulation costs.",
    "keywords": ["multi-fidelity", "transfer learning", "subsurface flow", "surrogate model", "deep learning"]
  },
  {
    "title": "Efficient deep-learning-based surrogate model for reservoir production optimization using transfer learning and multi-fidelity data",
    "authors": "Jian-Wei Cui, Wen-Yao Sun, Hyojung Jeong, et al.",
    "year": 2025,
    "journal": "Petroleum Science",
    "doi": "10.1016/j.petsci.2025.02.014",
    "abstract": "This study introduces a training procedure that leverages transfer learning with multi-fidelity training data to construct surrogate models efficiently. The method leads to about a 75% reduction in total computational cost compared to traditional training approaches without sacrificing prediction accuracy.",
    "keywords": ["transfer learning", "multi-fidelity", "reservoir simulation", "deep learning", "surrogate model"]
  },
  {
    "title": "Deep operator network for surrogate modeling of poroelasticity with random permeability fields",
    "authors": "Various",
    "year": 2025,
    "journal": "arXiv",
    "doi": "10.48550/arXiv.2509.11966",
    "abstract": "The surrogate model is evaluated on two benchmark problems in poroelasticity: soil consolidation and ground subsidence induced by groundwater extraction. For each case, training datasets are generated from finite element simulations, achieving high predictive accuracy.",
    "keywords": ["deep operator network", "poroelasticity", "surrogate model", "groundwater extraction"]
  },
  {
    "title": "A Hybrid DSCNN-GRU Based Surrogate Model for Transient Groundwater Flow Prediction",
    "authors": "Various",
    "year": 2025,
    "journal": "Applied Sciences (MDPI)",
    "doi": "10.3390/app15084576",
    "abstract": "This study develops a novel surrogate modelling approach, DSCNN-GRU, incorporating a deep separable convolutional neural network (DSCNN) and a gated recurrent unit (GRU), to efficiently capture temporal and spatial variations in groundwater head fields from transient groundwater flow models.",
    "keywords": ["deep learning", "groundwater flow", "convolutional neural network", "GRU", "surrogate model"]
  },
  {
    "title": "AI-enhanced groundwater management platform: A network-driven approach for simulation",
    "authors": "Various",
    "year": 2025,
    "journal": "ScienceDirect",
    "doi": "10.1016/j.jhydrol.2025.132XXX",
    "abstract": "Presents an AI-enhanced groundwater management framework (IGWM) that advances beyond traditional constraints by coupling physics-driven models (e.g., MODFLOW6) with surrogate learning approaches—Random Forest (RF) and Physics-Informed Neural Networks (PINNs)—to achieve both rapid simulation and physically consistent prediction.",
    "keywords": ["AI", "groundwater management", "MODFLOW", "physics-informed neural networks", "random forest"]
  },
  {
    "title": "Physics-informed surrogate modeling for supporting climate resilience at groundwater contamination sites",
    "authors": "Various (Oak Ridge National Laboratory)",
    "year": 2025,
    "journal": "Computers & Geosciences",
    "doi": "10.1016/j.cageo.2023.105508",
    "abstract": "These models are capable of forecasting groundwater pollution levels under diverse climatic situations and subsurface characteristics without necessitating a supercomputer, supporting climate resilience at groundwater contamination sites.",
    "keywords": ["physics-informed", "groundwater contamination", "climate resilience", "surrogate model"]
  },
  {
    "title": "Efficient Training of Deep-Learning-Based Surrogate Models for Subsurface Flow Simulation Using Multifidelity Data and Physics Constraints",
    "authors": "Various",
    "year": 2026,
    "journal": "SPE Journal",
    "doi": "10.2118/223500-PA",
    "abstract": "Proposes a physics-constrained surrogate (PCS) model training approach for production optimization that integrates multifidelity training data together with physics constraints. The approach starts with model pretraining on low-cost, low-fidelity training data, followed by model fine-tuning with high-fidelity samples.",
    "keywords": ["multifidelity", "physics constraints", "subsurface flow", "deep learning", "surrogate model"]
  },
  {
    "title": "Multi-fidelity graph neural networks for efficient and accurate flood hazard mapping",
    "authors": "Various",
    "year": 2025,
    "journal": "Journal of Hydrology",
    "doi": "10.1016/j.jhydrol.2025.132XXX",
    "abstract": "Integrates multi-resolution data on unstructured meshes with hierarchical learning. Outperforms single-fidelity models in diverse fluvial and pluvial flood scenarios and reduces reliance on expensive high-fidelity data without sacrificing accuracy.",
    "keywords": ["multi-fidelity", "graph neural networks", "flood hazard mapping", "hydrology"]
  },
  {
    "title": "VAE-DNN: Energy-Efficient Trainable-by-Parts Surrogate Model For Parametric Partial Differential Equations",
    "authors": "Various",
    "year": 2025,
    "journal": "arXiv",
    "doi": "10.48550/arXiv.2508.03839",
    "abstract": "VAE-DNN is compared to the FNO and DeepONet models for obtaining forward and inverse solutions to the nonlinear diffusion equation governing groundwater flow in an unconfined aquifer, demonstrating greater efficiency and superior accuracy.",
    "keywords": ["VAE", "deep neural network", "groundwater flow", "surrogate model", "PDE"]
  },
  {
    "title": "ConvLSTM-Based Surrogate Modeling for Flood Inflow Prediction at Namgang Dam",
    "authors": "Various",
    "year": 2025,
    "journal": "Journal of Hydrologic Engineering",
    "doi": "10.1061/JHYEFF.HEENG-6608",
    "abstract": "Examines the effectiveness of LSTM surrogate models in forecasting flood inflows, introducing a novel surrogate modeling approach that integrates physically simulated extreme scenarios generated by applying scale factors to observed rainfall data within the HEC-HMS model.",
    "keywords": ["LSTM", "flood prediction", "surrogate model", "hydrologic modeling"]
  },
  {
    "title": "A surrogate machine learning model using random forests for real-time flood inundation simulations",
    "authors": "Various",
    "year": 2025,
    "journal": "Journal of Hydrology",
    "doi": "10.1016/j.jhydrol.2025.131XXX",
    "abstract": "Addresses limitations by integrating hydrological parameters such as upstream discharge and physical catchment characteristics to enhance predictive accuracy and generalizability in flood inundation simulations.",
    "keywords": ["random forest", "flood inundation", "machine learning", "surrogate model"]
  },
  {
    "title": "Improved physics-informed neural network for reactive transport modeling of groundwater arsenic enrichment",
    "authors": "Various",
    "year": 2025,
    "journal": "Science China Earth Sciences",
    "doi": "10.1007/s11430-024-1590-x",
    "abstract": "The PH-PINNs model significantly outperforms traditional PINNs in capturing nonlinear and non-stationary dynamics, reducing the root mean square error (RMSE) by over 50% for groundwater arsenic transport modeling.",
    "keywords": ["physics-informed neural networks", "reactive transport", "arsenic", "groundwater quality"]
  },
  {
    "title": "Incorporating Deep Learning Into Hydrogeological Modeling: Advancements, Challenges, and Future Directions",
    "authors": "Various",
    "year": 2025,
    "journal": "Journal of Geophysical Research: Machine Learning and Computation",
    "doi": "10.1029/2025JH000703",
    "abstract": "Reviews the integration of deep learning approaches as efficient surrogate models for uncertainty quantification in hydrogeological modeling, handling non-Gaussian parameter fields and complex uncertainty scenarios.",
    "keywords": ["deep learning", "hydrogeology", "uncertainty quantification", "surrogate model"]
  }
]
